var objects = [
  '수건', '때밀이수건', '할머니때밀이수건', '흑돌', '백돌', '러브젤', '노트', '교재', '연필심', '샤프심', '휴대폰충전기', '마우스', '지우개', '테이저건', '콘돔', '분필', '젓가락', '잔디', '바리깡', '틀니', '잼민이휴대폰', '할아버지지팡이', '종이컵', '비타민', '리코더', '줄넘기', '프로틴', '단백질', '다데기', '탈모치료제', '생각하는의자', '단무지', '진라면순한맛', '짝퉁명품', '할머니리어카', '진동벨', '이쑤시개', '영양갱', '계란장수계란', '씹던껌', '고양이사료', '개사료', '휴지쪼가리', '냅킨', '락앤락통', '슬리퍼', '가발', '곽티슈', '케찹', '빨대', '마스크', '이유식', '에어컨', '연유', '돋보기', '홈런볼', '캐스터네츠', '숟가락', '파마산가루'
]
// 아래의 job[0] 배열과 합쳐져 result가 나옴

var jobs = [
  ['도둑', '연쇄절도범', '방문판매원', '테러범', '관찰자', '밑장빼기9단'],
  ['카사노바', '소리없는방귀빌런', '절대강자', '노숙자', '진상손님', '술고래', '터줏대감', '트월킹머신', '관짝춤머신', '화장실문지기', '탈모인협회장', '지박령', '푸드파이터', '잔반처리반', '앞을서성이는', '청소부장', '앞에서절두번하는', '축구대회태클마스터', '에서코딱지파다가뒤통수맞는', '개미핥기조련사', '공문서위조마스터', '층간소음마스터', '화장실변기뚜껑닫고볼일보는']
]
/*
작성 규칙:
인덱스 0 : 위의 objects 배열과 합쳐짐
인덱스 1 : 아래의 locations[0]의 배열과 합쳐짐
*/

var locations = [
  ['노인정', '사우나', '성인용품점', '러브호텔', '피시방', '국어학원', '수학학원', '영어학원', '과학학원', '기숙학원', '기숙사', '독서실', '대형마트', '스터디카페', '노약자석', '임산부석', '장애인석', '대형마트시식코너', '경찰서', '대중목욕탕', '무료급식소', '초등학교', '중학교', '고등학교', '편의점', '학원가', '세탁소', '풋살장', '미용실', '찜질방', '동사무소', '전통시장', '태권도장', '놀이터', '헬스장', '할매순댓국밥', '버스정류장', '삼성프라자', '국회의사당', '흡연실', '아파트관리사무소', '생활관', '서점', '도서관', '급식실', '휴대폰대리점', '주유소', '공원', '에버랜드', '롯데월드', '지하철', '지하철역', '시내버스', '고속버스', '중화반점', '동대문시장', '맘스터치', '맥도날드', '롯데리아', '우정사업본부', '산채비빔밥먹는스님앞에서', '길고양이급식소', '휴지통속', '반찬가게', '동물원', '왁싱샵', '노인복지관', '공중화장실', '설빙', '배스킨라빈스', '피자스쿨'],
  ['어린이보호구역', '장례식장', '수능갤러리', '공사장']
  //['폐지줍는할머니', '포식자', 'AD', '수능시험장', '결국사람', '펩시', '유모차레이스', '엄마가준비한식사', '어린이보호구역', '노인에게서슴지않고', '어린이탐정단', '냉탕에오줌싸서', '스키장상급자코스', '장례식장', '고구려대학교', '고아원', '수능갤러리', '공사장', '군부대', '훈련소', '납골당', '논', '밭', '롯데마트', '시공의폭풍', '웹툰미리보기사이트', '파인애플피자', '주식', '비트코인', '도박', '토토', '대학원연구실', '내다버린', '식물인간에게', '온라인클래스', '시대에', 'ISIS', '박스에서자고있는', '머리카락못내밀면서', '다이어트하는친구', '부모님등골', '지구평면설', '붕어빵에', '클럽가서놀다보니', '자택에서', '교회에서', '절에서', '연애경험이', '친구에어팟', '택시타고', '게임의폭력성을이해하기위해', '배고파서', '배고프면', '틀니', '벽돌집벽돌', '고깃집공깃밥', '뻐꾸기훔쳐가려고', '최종학력', '고시원냉장고김치통']
]
/*
작성규칙:
인덱스 0 : 위의 jobs[1] 배열과 합쳐짐
인덱스 1 : 아래의 specificLocations 오브젝트와 합쳐짐
*/

var specificLocations = {
  '':['', true],
  '어린이보호구역': ['스피드레이서', true],
  '장례식장' : ['육개장미식가', true],
  '수능갤러리' : ['삼수생', true],
  '공사장' : ['안전모도둑', true]
  // 'Pornhub' : ['대주주', true],
  // '웹툰미리보기사이트' : ['업로더', true],
  // '고아원' : ['에서아빠힘내세요를부르는', true],
  // '군부대' : ['전화선절단범', true],
  // '납골당' : ['generate.js 특별한 문장 정의에서 처리', true],
  // '펩시' : ['가핏속에흐르는', true],
  // '유모차레이스' : ['4관왕', true],
  // '롯데마트' : ['쇼핑카트뺑소니현행범', true],
  // '스키장상급자코스' : ['앞구르기장인', true],
}


// example Arrays
var exampleNames = [
  '엄준식', '손진웅', '이찬', '양효빈', '정성훈', '김동진', '문주은', '이정민', '이정호', '김대휘'
]
