var objects = [
  '수건', '때밀이수건', '할머니때밀이수건', '흑돌', '백돌', '러브젤', '노트', '교재', '연필심', '샤프심', '돈까스', '휴대폰충전기', '마우스', '지우개', '테이저건', '콘돔', '분필', '젓가락', '잔디', '바리깡', '틀니', '잼민이휴대폰', '할아버지지팡이', '종이컵', '비타민', '리코더', '줄넘기', '프로틴', '단백질', '다데기', '탈모치료제', '생각하는의자', '단무지', '진라면순한맛', '짝퉁명품', '할머니리어카', '진동벨', '이쑤시개', '영양갱', '계란장수계란', '씹던껌', '고양이사료', '개사료', '휴지쪼가리', '냅킨', '락앤락통', '슬리퍼', '가발', '곽티슈', '케찹', '빨대', '마스크', '이유식', '에어컨', '연유', '돋보기', '홈런볼', '캐스터네츠', '숟가락', '파마산가루', '콧물휴지', '면도기'
]
// 아래의 jobs 배열과 합쳐져 result가 나옴

var jobs = [
  '방문판매원', '관찰자', '심리치료사', '조향사', '비서', '요리사', '대표상담사', '교수', 'av배우', '파일럿', '의사', '수의사', '가수', '미식가', '청소부', '국회의원', '유튜버', '대통령비서', '바리스타', '앱개발자', '빅데이터분석가', '경제학자', '과학자', '수학자', '스튜디어스', '간호사', '타투이스트', '웹디자이너', '패션디자이너', '건축공학자', '토목공학자', '경찰', '소방관', '부동산중계인', '고등학교선생님', '중학교선생님', '초등학교선생님', '교장선생님', '교감선생님', '스트리머', '택시운전기사', '정보보안전문가', '건축설계사', '카지노딜러', '경영학자', '화가', '백댄서', '아이돌', '배우', '영화감독', '카메라감독', '사립탐정', '검사', '변호사', '프로게이머', '자영업자'
]
// 아래의 behavior 배열과 합쳐짐

var behaviors = [
  ['만보면흥분하는', '핥는', '훔치는', '뻬앗기는', '자랑하는', '만먹는', '인스타에올리는', '선물받고좋아하는'],
  ['파괴하는', '세금낼돈횡령하는', '에서브이로그찍는', '반찬훔치는', '의자앉기만하면부수는', '벽에낙서하는']
]
/*
인덱스 0 : object 배열과 합쳐짐
인덱스 1 : object 배열과 안합쳐짐
*/

var locations = [
  ['노인정', '사우나', '성인용품점', '러브호텔', '피시방', '국어학원', '수학학원', '영어학원', '과학학원', '기숙학원', '기숙사', '독서실', '대형마트', '스터디카페', '노약자석', '임산부석', '장애인석', '대형마트시식코너', '경찰서', '대중목욕탕', '무료급식소', '초등학교', '중학교', '고등학교', '편의점', '학원가', '세탁소', '풋살장', '미용실', '찜질방', '동사무소', '전통시장', '태권도장', '놀이터', '헬스장', '할매순댓국밥', '버스정류장', '삼성프라자', '국회의사당', '흡연실', '아파트관리사무소', '생활관', '서점', '도서관', '급식실', '휴대폰대리점', '주유소', '공원', '에버랜드', '롯데월드', '지하철', '지하철역', '시내버스', '고속버스', '중화반점', '동대문시장', '맘스터치', '맥도날드', '롯데리아', '우정사업본부', '길고양이급식소', '휴지통속', '반찬가게', '동물원', '왁싱샵', '노인복지관', '공중화장실', '설빙', '배스킨라빈스', '피자스쿨'],
  ['어린이보호구역', '장례식장', 'Pornhub', '웹툰미리보기사이트', '파주영어마을사는']
]
/*
작성규칙:
인덱스 0 : 위의 jobs 배열과 합쳐짐
인덱스 1 : 아래의 specificLocations 오브젝트와 합쳐짐
*/

var specificLocations = {
  '어린이보호구역': '카레이서',
  '장례식장': '육개장미식가',
  'Pornhub': '대주주',
  '웹툰미리보기사이트': '운영자',
  '파주영어마을사는': '국어선생님',
  '악질직업생성기를만든': '웹개발자',
}


// example Arrays
var exampleNames = [
  '엄준식', '손진웅', '이찬', '양효빈', '정성훈', '김동진', '문주은', '이정민', '이정호', '김대휘', '이유제'
]